Repository: zviratko/omlx
Catalog: apps/omlx-mac/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# settings.turboquant.bits.4
source: 4-bit
ru: 4-бит
zh_hans: 4 位

# settings.turboquant.bits.6
source: 6-bit
ru: 6-бит
zh_hans: 6 位

# settings.turboquant.bits.8
source: 8-bit
ru: 8-бит
zh_hans: 8 位

# settings.validator.min_p.range
source: Min P must be in [0, 1].
ru: Min P должен быть в диапазоне [0, 1].
zh_hans: 最小 P 必须在 [0, 1] 范围内。

# settings.validator.must_be_number
source: %@ must be a number.
ru: %@ должно быть числом.
zh_hans: %@ 必须是数字。

# settings.validator.penalty.range
source: %@ must be in [-2, 2].
ru: %@ должен быть в диапазоне [-2, 2].
zh_hans: %@ 必须在 [-2, 2] 范围内。

# settings.validator.presence_penalty.name
source: Presence Penalty
ru: Presence-штраф
zh_hans: 存在惩罚

# settings.validator.repetition_penalty.name
source: Repetition Penalty
ru: Repetition-штраф
zh_hans: 重复惩罚

# settings.validator.temperature.name
source: Temperature
ru: Температура
zh_hans: 温度

# settings.validator.temperature.range
source: Temperature must be ≥ 0.
ru: Temperature должна быть ≥ 0.
zh_hans: 温度必须 ≥ 0。

# settings.validator.top_k.integer
source: Top K must be an integer.
ru: Top K должен быть целым числом.
zh_hans: Top K 必须是整数。

# settings.validator.top_k.positive
source: Top K must be a positive integer.
ru: Top K должен быть положительным целым числом.
zh_hans: Top K 必须是正整数。

# settings.validator.top_p.range
source: Top P must be in (0, 1].
ru: Top P должен быть в диапазоне (0, 1].
zh_hans: Top P 必须在 (0, 1] 范围内。

# settings.vlm_mtp.conflict.dflash
source: Disable DFlash before enabling VLM MTP.
ru: Отключите DFlash перед включением VLM MTP.
zh_hans: 启用 VLM MTP 前禁用 DFlash。

# settings.vlm_mtp.conflict.mtp
source: Disable Lightning MTP before enabling VLM MTP.
ru: Отключите Lightning MTP перед включением VLM MTP.
zh_hans: 启用 VLM MTP 前禁用 Lightning MTP。

# settings.vlm_mtp.conflict.specprefill
source: Disable SpecPrefill before enabling VLM MTP.
ru: Отключите SpecPrefill перед включением VLM MTP.
zh_hans: 启用 VLM MTP 前禁用 SpecPrefill。

# settings.vlm_mtp.conflict.turboquant
source: Disable TurboQuant KV before enabling VLM MTP.
ru: Отключите TurboQuant KV перед включением VLM MTP.
zh_hans: 启用 VLM MTP 前禁用 TurboQuant KV。

# settings.vlm_mtp.draft.placeholder
source: Select assistant drafter…
ru: Выберите assistant drafter…
zh_hans: 选择助手起草器…

# sidebar.about
source: About
ru: О приложении
zh_hans: 关于

# sidebar.group.benchmark
source: Benchmark
ru: Бенчмарки
zh_hans: 基准测试

# sidebar.group.general
source: General
ru: Общее
zh_hans: 通用

# sidebar.group.models
source: Models
ru: Модели
zh_hans: 模型

# sidebar.group.server
source: Server
ru: Сервер
zh_hans: 服务器

# sidebar.integrations
source: Integrations
ru: Интеграции
zh_hans: 集成

# sidebar.security
source: Security
ru: Безопасность
zh_hans: 安全

# status.active_now.badge.generating
source: Generating
ru: Генерация
zh_hans: 生成中

# status.active_now.badge.loaded
source: Loaded
ru: Загружено
zh_hans: 已加载

# status.active_now.badge.waiting
source: Waiting
ru: Ожидание
zh_hans: 等待中

# status.active_now.empty
source: Server idle — no models loaded
ru: Сервер простаивает — модели не загружены
zh_hans: 服务器空闲 — 无模型已加载

# status.clear.alltime.help
source: Clear all-time stats
ru: Очистить статистику за все время
zh_hans: 清除全部时间统计

# status.clear.session.help
source: Clear session stats
ru: Очистить статистику сессии
zh_hans: 清除会话统计

# status.confirm.clear_alltime
source: Clear all-time stats? This cannot be undone.
ru: Очистить статистику за все время? Это действие нельзя отменить.
zh_hans: 清除全部时间统计？此操作无法撤销。

# status.confirm.clear_button
source: Clear
ru: Очистить
zh_hans: 清除

# status.confirm.clear_hot
source: Clear the in-memory KV cache for all loaded models? Subsequent requests will re-fault from SSD or recompute.
ru: Очистить KV-кэш в памяти для всех загруженных моделей? Следующие запросы снова загрузят данные с SSD или пересчитают кэш.
zh_hans: 清除所有已加载模型的内存 KV 缓存？后续请求将从 SSD 重新加载或重新计算。

# status.confirm.clear_session
source: Clear session stats?
ru: Очистить статистику сессии?
zh_hans: 清除会话统计？

# status.confirm.clear_ssd
source: Clear all SSD cache files? Loaded models will rebuild their KV cache on next prefill.
ru: Очистить все файлы SSD-кэша? Загруженные модели перестроят KV-кэш при следующем префилле.
zh_hans: 清除所有 SSD 缓存文件？已加载的模型将在下次预填充时重建 KV 缓存。

# status.row.gpu_memory
source: GPU Wired Memory
ru: Закрепленная память GPU
zh_hans: GPU 锁定内存

# status.row.gpu_utilization
source: GPU Utilization
ru: Загрузка GPU
zh_hans: GPU 使用率

# status.row.gpu_utilization.sub
source: Approximate · active request load
ru: Приблизительно · нагрузка активных запросов
zh_hans: 近似值 · 活跃请求负载

# status.row.server_uptime
source: Server Uptime
ru: Время работы сервера
zh_hans: 服务器运行时间

# status.row.system_ram
source: System RAM
ru: Системная RAM
zh_hans: 系统 RAM

# status.row.thermal_state
source: Thermal State
ru: Тепловое состояние
zh_hans: 热量状态

# status.row.version
source: oMLX Version
ru: Версия oMLX
zh_hans: oMLX 版本

# status.runtime_cache.block_size
source: Block size · %@
ru: Размер блока · %@
zh_hans: 块大小 · %@

# status.runtime_cache.clear_hot
source: Clear Memory Cache
ru: Очистить кэш в памяти
zh_hans: 清除内存缓存

# status.runtime_cache.clear_ssd
source: Clear SSD Cache
ru: Очистить SSD-кэш
zh_hans: 清除 SSD 缓存

# status.runtime_cache.file_count.count
source: Files: %lld
ru: Файлов: %lld
zh_hans: 文件：%lld

# status.runtime_cache.file_count.one
source: Files: 1
ru: Файлов: 1
zh_hans: 文件：1

# status.runtime_cache.file_count.other
source: Files: %lld
ru: Файлов: %lld
zh_hans: 文件：%lld

# status.runtime_cache.files
source: Cache Files
ru: Файлы кэша
zh_hans: 缓存文件

# status.runtime_cache.location
source: Location
ru: Расположение
zh_hans: 位置

# status.runtime_cache.memory
source: Memory Cache
ru: Кэш в памяти
zh_hans: 内存缓存

# status.runtime_cache.memory_entries
source: Memory Entries
ru: Записи в памяти
zh_hans: RAM 条目

# status.runtime_cache.memory_entries.count
source: Entries: %lld
ru: Записей: %lld
zh_hans: 条目：%lld

# status.runtime_cache.memory_entries.one
source: Entries: 1
ru: Записей: 1
zh_hans: 条目：1

# status.runtime_cache.memory_entries.other
source: Entries: %lld
ru: Записей: %lld
zh_hans: 条目：%lld

# status.runtime_cache.size
source: Total Size
ru: Общий размер
zh_hans: 总大小

# status.section.active_now
source: Active Now
ru: Активно сейчас
zh_hans: 当前活跃

# status.section.runtime_cache
source: Runtime Cache
ru: Runtime-кэш
zh_hans: 运行时缓存

# status.section.system
source: System
ru: Система
zh_hans: 系统

# status.speed.prompt_processing
source: Prompt Processing
ru: Обработка промпта
zh_hans: 提示词处理

# status.speed.prompt_processing_note
source: (excl. cached)
ru: (без кэшированных)
zh_hans: （不含已缓存）

# status.speed.prompt_processing.tile
source: Prompt Processing (excl. cached)
ru: Обработка промпта (без кэшированных)
zh_hans: 预填充处理（不含已缓存）

# status.speed.section_label
source: Average Speed
ru: Средняя скорость
zh_hans: 平均速度

# status.speed.token_generation
source: Token Generation
ru: Генерация токенов
zh_hans: Token 生成

# status.tile.cache_efficiency
source: Cache Efficiency
ru: Эффективность кэша
zh_hans: 缓存效率

# status.tile.cached
source: Cached Tokens
ru: Кэшированные токены
zh_hans: 已缓存 Token

# status.tile.generation
source: Generation
ru: Генерация
zh_hans: 生成

# status.tile.generation.sub
source: across active models
ru: по активным моделям
zh_hans: 跨活跃模型

# status.tile.requests
source: Requests
ru: Запросы
zh_hans: 请求

# status.tile.total
source: Total Prefill Tokens
ru: Всего токенов префилла
zh_hans: 预填充 Token 总数

# status.tile.total.sub
source: prompt + completion
ru: промпт + ответ
zh_hans: 提示 + 补全

# status.updates.auto_check
source: Automatically Check
ru: Проверять автоматически
zh_hans: 自动检查

# status.updates.auto_check.sub
source: Look for updates daily in the background
ru: Искать обновления ежедневно в фоне
zh_hans: 每天在后台查找更新

# status.updates.auto_download
source: Notify About Updates
ru: Уведомлять об обновлениях
zh_hans: 通知更新

# status.updates.auto_download.sub
source: Show release notes before downloading in the background
ru: Показывать примечания к выпуску перед фоновым скачиванием
zh_hans: 在后台下载前显示版本说明

# status.updates.available_primary
source: oMLX %@ is available
ru: Доступен oMLX %@
zh_hans: oMLX %@ 已可用

# status.updates.available_secondary
source: Ready to download · %@
ru: Готово к скачиванию · %@
zh_hans: 准备下载 · %@

# status.updates.channel
source: Update Channel
ru: Канал обновлений
zh_hans: 更新通道

# status.updates.channel.sub
source: Stable receives tested releases. Beta gets new features sooner.
ru: Стабильный канал получает проверенные релизы. Бета-канал раньше получает новые функции.
zh_hans: 稳定版接收经过测试的发布。测试版更快获得新功能。

# status.updates.check
source: Check Now
ru: Проверить сейчас
zh_hans: 立即检查

# status.updates.checking_button
source: Checking…
ru: Проверка…
zh_hans: 正在检查…

# status.updates.checking_primary
source: Checking for updates…
ru: Проверка обновлений…
zh_hans: 正在检查更新…

# status.updates.checking_secondary
source: Checking GitHub releases…
ru: Проверка релизов GitHub…
zh_hans: 正在检查 GitHub 发布…

# status.updates.downloading_button
source: Downloading… %lld%%
ru: Скачивание… %lld%%
zh_hans: 正在下载… %lld%%

# status.updates.downloading_primary
source: Downloading update…
ru: Скачивание обновления…
zh_hans: 正在下载更新…

# status.updates.downloading_secondary
source: Downloading · %lld%%
ru: Скачивание · %lld%%
zh_hans: 下载中 · %lld%%

# status.updates.error_primary
source: Update check failed
ru: Не удалось проверить обновления
zh_hans: 更新检查失败

# status.updates.install
source: Install & Restart
ru: Установить и перезапустить
zh_hans: 安装并重启

# status.updates.last_checked_date
source: Last checked %@
ru: Последняя проверка %@
zh_hans: 上次检查 %@

# status.updates.last_checked_today
source: Last checked today at %@
ru: Последняя проверка сегодня в %@
zh_hans: 今天 %@ 检查过

# status.updates.never_checked
source: Never checked
ru: Проверок еще не было
zh_hans: 从未检查

# status.updates.ready_secondary
source: %@ is ready to install
ru: %@ готова к установке
zh_hans: %@ 已准备安装

# status.updates.title
source: Updates
ru: Обновления
zh_hans: 更新

# status.updates.up_to_date_primary
source: oMLX is up to date
ru: Установлена последняя версия oMLX
zh_hans: oMLX 已是最新版本

# status.version.text
source: %1$@ · build %2$@
ru: %1$@ · сборка %2$@
zh_hans: %1$@ · 构建 %2$@

# status.usage.heading
source: Usage History
ru: История использования
zh_hans: 使用历史

# status.usage.subtitle
source: Local aggregates · server local time · 400-day retention
ru: Локальные агрегаты · локальное время сервера · хранение 400 дней
zh_hans: 本地聚合 · 服务器本地时间 · 保留 400 天

# status.usage.range
source: Time range
ru: Период
zh_hans: 时间范围

# status.usage.range.today
source: Today
ru: Сегодня
zh_hans: 今天

# status.usage.range.yesterday
source: Yesterday
ru: Вчера
zh_hans: 昨天

# status.usage.range.7d
source: 7 Days
ru: 7 дней
zh_hans: 7 天

# status.usage.range.30d
source: 30 Days
ru: 30 дней
zh_hans: 30 天

# status.usage.range.90d
source: 90 Days
ru: 90 дней
zh_hans: 90 天

# status.usage.range.month
source: This Month
ru: Этот месяц
zh_hans: 本月

# status.usage.model
source: Model
ru: Модель
zh_hans: 模型

# status.usage.all_models
source: All Models
ru: Все модели
zh_hans: 所有模型

# status.usage.empty
source: No recorded usage in this range. History begins after upgrading.
ru: В этом периоде нет записей об использовании. История ведётся с момента обновления.
zh_hans: 此范围内没有使用记录。历史记录自升级后开始。

# status.usage.delayed
source: History may be incomplete: storage is delayed or the pending buffer overflowed.
ru: История может быть неполной: запись задерживается или буфер ожидания переполнен.
zh_hans: 历史记录可能不完整：存储延迟或待处理缓冲区已溢出。

# status.usage.unavailable
source: Usage history is unavailable. Inference continues normally.
ru: История использования недоступна. Инференс продолжает работать.
zh_hans: 使用历史不可用。推理正常继续。

# status.usage.disabled
source: Usage history is off. Turn it on in Server settings.
ru: История использования отключена. Включите её в настройках сервера.
zh_hans: 使用历史已关闭。请在服务器设置中开启。

# status.usage.open_settings
source: Open Server Settings
ru: Открыть настройки сервера
zh_hans: 打开服务器设置

# status.usage.tile.requests
source: Requests
ru: Запросы
zh_hans: 请求

# status.usage.tile.total
source: Total Tokens
ru: Всего токенов
zh_hans: Token 总数

# status.usage.tile.prompt
source: Prompt Tokens
ru: Токены промпта
zh_hans: 提示 Token

# status.usage.tile.output
source: Output Tokens
ru: Выходные токены
zh_hans: 输出 Token

# status.usage.tile.cached
source: Cached Tokens
ru: Кэшированные токены
zh_hans: 已缓存 Token

# status.usage.heatmap.title
source: Token Usage by Day and Hour
ru: Использование токенов по дням и часам
zh_hans: 按日期和小时的 Token 使用量

# status.usage.heatmap.note
source: 00–23 hours · darker green means more tokens · repeated DST hours combine
ru: Часы 00–23 · чем темнее зелёный, тем больше токенов · повторные часы при переводе времени объединяются
zh_hans: 00–23 时 · 绿色越深表示 Token 越多 · 夏令时重复的小时会合并

# status.usage.row.tokens
source: %@ tokens
ru: %@ токенов
zh_hans: %@ Token

# status.usage.row.requests_speed
source: %1$lld requests · %2$@ tok/s
ru: %1$lld запросов · %2$@ ток/с
zh_hans: %1$lld 个请求 · %2$@ tok/s

# status.usage.row.detail
source: Prompt %1$@ · output %2$@ · cached %3$@
ru: Промпт %1$@ · вывод %2$@ · кэш %3$@
zh_hans: 提示 %1$@ · 输出 %2$@ · 已缓存 %3$@

# status.usage.heatmap.cell
source: %1$@ %2$@:00 · %3$@ tokens
ru: %1$@ %2$@:00 · %3$@ токенов
zh_hans: %1$@ %2$@:00 · %3$@ Token

# update.channel.beta
source: Beta
ru: Бета

# update.channel.nightly
source: Nightly
ru: Ночная сборка

# update.channel.release_candidate
source: Release Candidate
ru: Релиз-кандидат
zh_hans: 候选发布版

# update.channel.stable
source: Stable
ru: Стабильный
zh_hans: 稳定版

# update.confirm.empty_notes
source: This release does not include detailed notes.
ru: Для этого релиза нет подробных заметок.
zh_hans: 此版本没有详细的更新说明。

# update.confirm.install
source: Download, Install & Relaunch
ru: Скачать, установить и открыть заново
zh_hans: 下载、安装并重启

# update.confirm.install_ready
source: Install & Relaunch
ru: Установить и открыть заново
zh_hans: 安装并重启

# update.confirm.later
source: Later
ru: Позже
zh_hans: 稍后

# update.confirm.restart_notice
source: oMLX will quit, install the update, and relaunch.
ru: oMLX завершит работу, установит обновление и запустится снова.
zh_hans: oMLX 将退出、安装更新并重新启动。

# update.confirm.size
source: Download size: %@
ru: Размер скачивания: %@
zh_hans: 下载大小：%@

# update.confirm.subtitle
source: Review the release notes before downloading and relaunching.
ru: Просмотрите примечания к выпуску перед скачиванием и перезапуском.
zh_hans: 请在下载并重启前查看更新说明。

# update.confirm.title
source: oMLX %@ is available
ru: Доступен oMLX %@
zh_hans: oMLX %@ 可用

# update.confirm.view_release
source: View release on GitHub
ru: Открыть релиз на GitHub
zh_hans: 在 GitHub 上查看发布版本

# update.error.no_dmg
source: No installable DMG was attached to this release.
ru: К этому релизу не прикреплен устанавливаемый DMG.
zh_hans: 此版本没有附带可安装的 DMG 文件。

# update.error.swap_failed
source: Could not find the staged update. Try downloading again.
ru: Не удалось найти подготовленное обновление. Попробуйте скачать его снова.
zh_hans: 找不到已暂存的更新。请尝试重新下载。

# welcome.api_key.hide
source: Hide key
ru: Скрыть ключ
zh_hans: 隐藏密钥

# welcome.api_key.label
source: API Key
ru: API-ключ
zh_hans: API 密钥

# welcome.api_key.placeholder
source: Create an API key
ru: Создайте API-ключ
zh_hans: 创建 API 密钥

# welcome.api_key.show
source: Show key
ru: Показать ключ
zh_hans: 显示密钥

# welcome.api_key.sub
source: This key is also your Web Dashboard login password.
ru: Этот ключ также является паролем для входа в веб-панель.
zh_hans: 此密钥也是你的 Web 仪表盘登录密码。

# welcome.browse.base_message
source: Choose a parent folder. An .omlx directory will be created inside it.
ru: Выберите родительскую папку. Внутри нее будет создан каталог .omlx.
zh_hans: 选择一个父文件夹。将在其中创建 .omlx 目录。

# welcome.browse.model_message
source: Choose the directory containing your model files.
ru: Выберите каталог, содержащий файлы моделей.
zh_hans: 选择包含模型文件的目录。

# welcome.browse.prompt
source: Select
ru: Выбрать
zh_hans: 选择

# welcome.button.browse
source: Browse…
ru: Обзор…
zh_hans: 浏览…

# welcome.button.get_started
source: Get Started
ru: Начать
zh_hans: 开始使用

# welcome.button.open_dashboard
source: Open Web Dashboard
ru: Открыть веб-панель
zh_hans: 打开 Web 仪表盘

# welcome.button.start_server
source: Start Server
ru: Запустить сервер
zh_hans: 启动服务器

# welcome.button.starting
source: Starting Server...
ru: Запуск сервера...
zh_hans: 正在启动服务器…

# welcome.complete.description
source: oMLX is running locally at http://127.0.0.1:%@. Open the web dashboard to download your first model, manage settings, and connect your coding tools.
ru: oMLX работает локально по адресу http://127.0.0.1:%@. Откройте веб-панель, чтобы скачать первую модель, управлять настройками и подключить инструменты для разработки.
zh_hans: oMLX 正在本地 http://127.0.0.1:%@ 上运行。打开 Web 仪表盘下载第一个模型、管理设置并连接你的编程工具。

# welcome.complete.status
source: Server started. Dashboard is ready.
ru: Сервер запущен. Панель готова.
zh_hans: 服务器已启动。仪表盘已就绪。

# welcome.complete.title
source: All set!
ru: Все готово!
zh_hans: 一切就绪！

# welcome.error.base_dir_required
source: Base directory is required.
ru: Требуется базовый каталог.
zh_hans: 基础目录为必填项。

# welcome.error.invalid_port
source: Invalid port.
ru: Недопустимый порт.
zh_hans: 端口无效。

# welcome.error.key_non_ascii
source: API key must contain only printable ASCII.
ru: API-ключ должен содержать только печатные ASCII-символы.
zh_hans: API 密钥必须仅包含可打印的 ASCII 字符。

# welcome.error.key_too_short
source: API key must be at least 4 characters.
ru: API-ключ должен быть не короче 4 символов.
zh_hans: API 密钥至少需要 4 个字符。

# welcome.error.key_whitespace
source: API key must not contain whitespace.
ru: API-ключ не должен содержать пробельные символы.
zh_hans: API 密钥不能包含空格。

# welcome.error.mkdir_failed
source: Cannot create base directory: %@
ru: Не удалось создать базовый каталог: %@
zh_hans: 无法创建基础目录：%@

# welcome.error.port_in_use
source: Port %@ is already in use.
ru: Порт %@ уже занят.
zh_hans: 端口 %@ 已被占用。

# welcome.error.port_in_use_omlx
source: Port %@ is already in use (oMLX server already running).
ru: Порт %@ уже занят (сервер oMLX уже запущен).
zh_hans: 端口 %@ 已被占用（oMLX 服务器已在运行）。

# welcome.error.port_out_of_range
source: Port must be a number between 1 and 65535.
ru: Порт должен быть числом от 1 до 65535.
zh_hans: 端口必须是 1 到 65535 之间的数字。

# welcome.error.python_runtime_failed
source: Failed to locate Python runtime: %@
ru: Не удалось найти Python runtime: %@
zh_hans: 无法定位 Python 运行时：%@

# welcome.error.save_config_failed
source: Failed to save config: %@
ru: Не удалось сохранить конфигурацию: %@
zh_hans: 无法保存配置：%@

# welcome.error.start_server_failed
source: Failed to start server: %@
ru: Не удалось запустить сервер: %@
zh_hans: 无法启动服务器：%@

# welcome.header.meta
source: Apple Silicon · macOS-native · Apache 2.0
ru: Apple Silicon · нативно для macOS · Apache 2.0
zh_hans: Apple Silicon · macOS 原生 · Apache 2.0

# welcome.header.subtitle
source: Local AI, no more waiting.
ru: Локальный AI без ожидания.
zh_hans: 本地 AI，无需等待。

# welcome.header.tagline
source: macOS-native MLX server with smart caching. Claude Code, OpenClaw, and Cursor respond in 5 seconds, not 90.
ru: Нативный для macOS MLX-сервер с умным кэшированием. Claude Code, OpenClaw и Cursor отвечают за 5 секунд, а не за 90.
zh_hans: macOS 原生 MLX 服务器，智能缓存。 Claude Code、OpenClaw 和 Cursor 5 秒响应，而非 90 秒。

# welcome.hint.settings_path
source: Settings are stored in ~/.omlx/settings.json.
ru: Настройки хранятся в ~/.omlx/settings.json.
zh_hans: 设置存储在 ~/.omlx/settings.json。

# welcome.intro
source: Choose where models live, pick a port, and create the API key you'll use from apps and the web dashboard.
ru: Выберите место хранения моделей, порт и создайте API-ключ, который будете использовать из приложений и веб-панели.
zh_hans: 选择模型存储位置、选择端口，并创建你将从应用和 Web 仪表盘使用的 API 密钥。

# welcome.setup.local.body
source: oMLX binds to 127.0.0.1 on first run, so clients on this Mac can use it without exposing the server to your network.
ru: При первом запуске oMLX привязывается к 127.0.0.1, поэтому клиенты на этом Mac могут использовать его без публикации сервера в сеть.
zh_hans: oMLX 首次运行时绑定 127.0.0.1，因此本机上的客户端可以使用它，而不会将服务器暴露给网络。

# welcome.setup.local.title
source: Local server
ru: Локальный сервер
zh_hans: 本地服务器

# welcome.setup.title
source: Set up your local server
ru: Настройте локальный сервер
zh_hans: 设置你的本地服务器

# welcome.storage.model_dir.label
source: Model Directory
ru: Каталог моделей
zh_hans: 模型目录

# welcome.storage.model_dir.sub
source: Where downloaded models are stored.
ru: Где хранятся скачанные модели.
zh_hans: 下载模型的存储位置。

# welcome.storage.port.label
source: Port
ru: Порт
zh_hans: 端口

# welcome.storage.port.sub
source: Default 8000. Change this only if the port is already in use.
ru: По умолчанию 8000. Меняйте только если порт уже занят.
zh_hans: 默认 8000。仅当端口已被占用时更改。

# welcome.window.title
source: Welcome to oMLX
ru: Добро пожаловать в oMLX
zh_hans: 欢迎使用 oMLX

# app.command.close_window
source: Close Window
zh_hans: 关闭窗口

# common.copy.help
source: Click to copy
zh_hans: 点击复制

# settings.experimental.qwen_ane.tuner.menu
source: Tuner overrides
zh_hans: 调优覆盖

# settings.experimental.qwen_ane.tuner.allow_cpu_offload
source: Allow CPU offload
zh_hans: 允许 CPU 卸载

# settings.experimental.qwen_ane.tuner.allow_cpu_gate
source: Allow CPU gate/up
zh_hans: 允许 CPU 门控/上投影

# settings.experimental.qwen_ane.tuner.allow_cpu_down
source: Allow CPU down projection
zh_hans: 允许 CPU 下投影

# settings.experimental.qwen_ane.tuner.allow_ane_gdn
source: Allow GDN on ANE
zh_hans: 允许 ANE 运行 GDN

# settings.experimental.qwen_ane.tuner.allow_cpu_gdn
source: Allow GDN on CPU
zh_hans: 允许 CPU 运行 GDN

# settings.experimental.qwen_ane.tuner.allow_cpu_shared
source: Allow performance-aware CPU scheduling
zh_hans: 允许 CPU 性能感知调度

# settings.experimental.qwen_ane.tuner.use_result
source: Use result
zh_hans: 使用结果

# settings.experimental.qwen_ane.tuner.tune_again
source: Tune again
zh_hans: 重新调优

# settings.experimental.qwen_ane.tuner.tune_for_mac
source: Tune for this Mac
zh_hans: 为这台 Mac 调优

# bench.context.button.run
source: Start Benchmark
zh_hans: 开始基准测试

# bench.context.capped.memory
source: Available memory
zh_hans: 可用内存

# bench.context.capped.native
source: Model's native context length
zh_hans: 模型原生上下文长度

# bench.context.capped.target
source: Selected target
zh_hans: 选择的目标

# bench.context.header.eyebrow
source: Context Benchmark
zh_hans: 上下文基准测试

# bench.context.header.subtitle
source: Finds the largest context window this machine can actually prefill for a model, then applies it to the model's Context Window setting.
zh_hans: 查找这台机器实际上能为模型预填充的最大上下文窗口，然后将其应用到模型的上下文窗口设置。

# bench.context.header.title
source: Measure usable context
zh_hans: 测量可用上下文

# bench.context.model.loaded_badge
source: %@ • loaded
zh_hans: %@ • 已加载

# bench.context.model.placeholder
source: Select a model…
zh_hans: 选择模型…

# bench.context.progress.starting
source: Starting…
zh_hans: 开始中…

# bench.context.result.applied_note
source: The value has been applied to this model's Context Window setting.
zh_hans: 该值已应用到此模型的上下文窗口设置。

# bench.context.result.capped_by
source: Limited by
zh_hans: 受限于

# bench.context.result.duration
source: Duration
zh_hans: 持续时间

# bench.context.result.measured
source: Admission boundary
zh_hans: 准入边界

# bench.context.result.prefill_tps
source: Prefill speed
zh_hans: 预填充速度

# bench.context.result.snapshot_note
source: The result reflects free memory and the Memory Guard tier at benchmark time; rerun after major changes to either.
zh_hans: 结果反映基准测试时的可用内存和内存防护层级；两者任一发生重大变化后，请重新运行。

# bench.context.result.tokens_label
source: tokens applied to Context Window
zh_hans: 个 Token 已应用到上下文窗口
